<?php
return [
    'trouble' => [
        'cause_type' => [
            1 => '仕様漏れ',
            2 => '仕様誤り',
            3 => '設計漏れ',
            4 => '設計誤り',
            5 => '実装漏れ',
            6 => '実装誤り',
            7 => 'テスト項目誤り',
            99 => 'その他'
        ],

        'cause_process' => [
            1 => '要件定義',
            2 => '仕様作成',
            3 => '基本設計',
            4 => '詳細設計',
            5 => '実装',
            6 => '単体テスト',
            7 => '結合テスト',
            99 => 'その他'
        ],

        'function' => [
            1 => 'ログイン',
            2 => 'ログアウト',
            3 => 'トップ',
            4 => '障害報告',
            5 => '日報',
            99 => 'その他'
        ],

        'priority' => [
            1 => '今すぐ',
            2 => '高',
            3 => '中',
            4 => '低'
        ],

        'status' => [
            1 => '起票',
            2 => '対応中',
            3 => '対応完了',
            4 => '検証中',
            5 => '検証完了',
            6 => '完了（上長承認済み）',
            99 => '削除'
        ],

        'register_type' => [
            1 => '障害報告',
            2 => '管理登録'
        ],
    ]
];
